spec/cassettes/Subscription/_billable_today/does_not_include_subscriptions_that_have_been_billed_in_the_last_month.yml

---
http_interactions:
- request:
    method: post
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts
    body:
      encoding: UTF-8
      string: '{"account_number":"9900000002","account_type":"checking","name":"Johann
        Bernoulli","routing_number":"021000021"}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.0
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Access-Control-Allow-Headers:
      - Content-Type
      Access-Control-Allow-Methods:
      - POST, OPTIONS
      Access-Control-Allow-Origin:
      - '*'
      Content-Type:
      - application/json
      Date:
      - Fri, 04 Jul 2014 04:08:48 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMe61d6f3c033011e49beb02a1fe52a36c
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-201
      X-Balanced-Marketplace:
      - TEST-MP1mjbKr3ZseFeWrJb4R03lj
      X-Balanced-Merchant:
      - TEST-MR1lb6D220PWeBKNmZs46597
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.2.76
      X-Midlr-Version:
      - '2'
      X-Newrelic-App-Data:
      - PxQFWFNXCQYTVVhWAwQDVUYdFhE1AwE2QgNWEVlbQFtcCxYxSBVbDQoZVA4IF0pcXAgEEBhTVggPbldQAQkWDEQRFgFKXVVGVkcVQQFNE1JKBARXVlcPCghXUFQOBAJTUgcaE1BUVU4QQABbXA9WAgFSW1IDA1dVUwEVTUYFWV9DATw=
      Content-Length:
      - '1291'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_accounts": [
            {
              "routing_number": "021000021",
              "bank_name": "JPMORGAN CHASE BANK",
              "account_type": "checking",
              "name": "Johann Bernoulli",
              "links": {
                "customer": null,
                "bank_account_verification": null
              },
              "can_credit": true,
              "created_at": "2014-07-04T04:08:48.396716Z",
              "fingerprint": "2ef53fa3f76e47c5930f77fe0a59aa103b5abfd5622f08305b786808ec574a1e",
              "updated_at": "2014-07-04T04:08:48.396719Z",
              "href": "/bank_accounts/BA70rqBlsiiZkoCixFDtEkm5",
              "meta": {},
              "account_number": "xxxxxx0002",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": false,
              "id": "BA70rqBlsiiZkoCixFDtEkm5"
            }
          ],
          "links": {
            "bank_accounts.credits": "/bank_accounts/{bank_accounts.id}/credits",
            "bank_accounts.bank_account_verifications": "/bank_accounts/{bank_accounts.id}/verifications",
            "bank_accounts.customer": "/customers/{bank_accounts.customer}",
            "bank_accounts.debits": "/bank_accounts/{bank_accounts.id}/debits",
            "bank_accounts.bank_account_verification": "/verifications/{bank_accounts.bank_account_verification}"
          }
        }
    http_version: 
  recorded_at: Fri, 04 Jul 2014 04:08:48 GMT
- request:
    method: get
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BA70rqBlsiiZkoCixFDtEkm5
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.0
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Fri, 04 Jul 2014 04:08:48 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMe68c67f2033011e4a4e806429171ffad
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-201
      X-Balanced-Marketplace:
      - TEST-MP1mjbKr3ZseFeWrJb4R03lj
      X-Balanced-Merchant:
      - TEST-MR1lb6D220PWeBKNmZs46597
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.2.76
      Content-Length:
      - '497'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_accounts": [
            {
              "routing_number": "021000021",
              "bank_name": "JPMORGAN CHASE BANK",
              "account_type": "checking",
              "name": "Johann Bernoulli",
              "links": {
                "customer": null,
                "bank_account_verification": null
              },
              "can_credit": true,
              "created_at": "2014-07-04T04:08:48.396716Z",
              "fingerprint": "2ef53fa3f76e47c5930f77fe0a59aa103b5abfd5622f08305b786808ec574a1e",
              "updated_at": "2014-07-04T04:08:48.396719Z",
              "href": "/bank_accounts/BA70rqBlsiiZkoCixFDtEkm5",
              "meta": {},
              "account_number": "xxxxxx0002",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": false,
              "id": "BA70rqBlsiiZkoCixFDtEkm5"
            }
          ],
          "links": {
            "bank_accounts.credits": "/bank_accounts/{bank_accounts.id}/credits",
            "bank_accounts.bank_account_verifications": "/bank_accounts/{bank_accounts.id}/verifications",
            "bank_accounts.customer": "/customers/{bank_accounts.customer}",
            "bank_accounts.debits": "/bank_accounts/{bank_accounts.id}/debits",
            "bank_accounts.bank_account_verification": "/verifications/{bank_accounts.bank_account_verification}"
          }
        }
    http_version: 
  recorded_at: Fri, 04 Jul 2014 04:08:49 GMT
- request:
    method: post
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BA70rqBlsiiZkoCixFDtEkm5/verifications
    body:
      encoding: UTF-8
      string: '{}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.0
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Content-Type:
      - application/json
      Date:
      - Fri, 04 Jul 2014 04:08:57 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMe6d28980033011e4b7da06429171ffad
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP1mjbKr3ZseFeWrJb4R03lj
      X-Balanced-Merchant:
      - TEST-MR1lb6D220PWeBKNmZs46597
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.2.76
      Content-Length:
      - '599'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_account_verifications": [
            {
              "verification_status": "pending",
              "links": {
                "bank_account": "BA70rqBlsiiZkoCixFDtEkm5"
              },
              "href": "/verifications/BZ79pysiv58sBdDhr8HqzxS5",
              "created_at": "2014-07-04T04:08:56.375627Z",
              "attempts_remaining": 3,
              "updated_at": "2014-07-04T04:08:56.680811Z",
              "deposit_status": "succeeded",
              "attempts": 0,
              "meta": {},
              "id": "BZ79pysiv58sBdDhr8HqzxS5"
            }
          ],
          "links": {
            "bank_account_verifications.bank_account": "/bank_accounts/{bank_account_verifications.bank_account}"
          }
        }
    http_version: 
  recorded_at: Fri, 04 Jul 2014 04:08:57 GMT
- request:
    method: get
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/verifications/BZ79pysiv58sBdDhr8HqzxS5
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.0
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Fri, 04 Jul 2014 04:08:57 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMebaa14dc033011e4aecc02b12035401b
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP1mjbKr3ZseFeWrJb4R03lj
      X-Balanced-Merchant:
      - TEST-MR1lb6D220PWeBKNmZs46597
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.2.76
      Content-Length:
      - '599'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_account_verifications": [
            {
              "verification_status": "pending",
              "links": {
                "bank_account": "BA70rqBlsiiZkoCixFDtEkm5"
              },
              "href": "/verifications/BZ79pysiv58sBdDhr8HqzxS5",
              "created_at": "2014-07-04T04:08:56.375627Z",
              "attempts_remaining": 3,
              "updated_at": "2014-07-04T04:08:56.680811Z",
              "deposit_status": "succeeded",
              "attempts": 0,
              "meta": {},
              "id": "BZ79pysiv58sBdDhr8HqzxS5"
            }
          ],
          "links": {
            "bank_account_verifications.bank_account": "/bank_accounts/{bank_account_verifications.bank_account}"
          }
        }
    http_version: 
  recorded_at: Fri, 04 Jul 2014 04:08:57 GMT
- request:
    method: put
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/verifications/BZ79pysiv58sBdDhr8HqzxS5
    body:
      encoding: UTF-8
      string: '{"verification_status":"pending","links":{"bank_account":"BA70rqBlsiiZkoCixFDtEkm5"},"created_at":"2014-07-04T04:08:56.375627Z","attempts_remaining":3,"updated_at":"2014-07-04T04:08:56.680811Z","deposit_status":"succeeded","attempts":0,"meta":{},"id":"BZ79pysiv58sBdDhr8HqzxS5","amount_1":1,"amount_2":1}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.0
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Fri, 04 Jul 2014 04:08:57 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMebe0ea70033011e48ad106429171ffad
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP1mjbKr3ZseFeWrJb4R03lj
      X-Balanced-Merchant:
      - TEST-MR1lb6D220PWeBKNmZs46597
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.2.76
      Content-Length:
      - '601'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_account_verifications": [
            {
              "verification_status": "succeeded",
              "links": {
                "bank_account": "BA70rqBlsiiZkoCixFDtEkm5"
              },
              "href": "/verifications/BZ79pysiv58sBdDhr8HqzxS5",
              "created_at": "2014-07-04T04:08:56.375627Z",
              "attempts_remaining": 2,
              "updated_at": "2014-07-04T04:08:57.924247Z",
              "deposit_status": "succeeded",
              "attempts": 1,
              "meta": {},
              "id": "BZ79pysiv58sBdDhr8HqzxS5"
            }
          ],
          "links": {
            "bank_account_verifications.bank_account": "/bank_accounts/{bank_account_verifications.bank_account}"
          }
        }
    http_version: 
  recorded_at: Fri, 04 Jul 2014 04:08:58 GMT
- request:
    method: get
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BA70rqBlsiiZkoCixFDtEkm5
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/1.1.0
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Fri, 04 Jul 2014 04:08:58 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMec16be52033011e4ac8902b12035401b
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-201
      X-Balanced-Marketplace:
      - TEST-MP1mjbKr3ZseFeWrJb4R03lj
      X-Balanced-Merchant:
      - TEST-MR1lb6D220PWeBKNmZs46597
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.2.76
      Content-Length:
      - '521'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "bank_accounts": [
            {
              "routing_number": "021000021",
              "bank_name": "JPMORGAN CHASE BANK",
              "account_type": "checking",
              "name": "Johann Bernoulli",
              "links": {
                "customer": null,
                "bank_account_verification": "BZ79pysiv58sBdDhr8HqzxS5"
              },
              "can_credit": true,
              "created_at": "2014-07-04T04:08:48.396716Z",
              "fingerprint": "2ef53fa3f76e47c5930f77fe0a59aa103b5abfd5622f08305b786808ec574a1e",
              "updated_at": "2014-07-04T04:08:57.922290Z",
              "href": "/bank_accounts/BA70rqBlsiiZkoCixFDtEkm5",
              "meta": {},
              "account_number": "xxxxxx0002",
              "address": {
                "city": null,
                "line2": null,
                "line1": null,
                "state": null,
                "postal_code": null,
                "country_code": null
              },
              "can_debit": true,
              "id": "BA70rqBlsiiZkoCixFDtEkm5"
            }
          ],
          "links": {
            "bank_accounts.credits": "/bank_accounts/{bank_accounts.id}/credits",
            "bank_accounts.bank_account_verifications": "/bank_accounts/{bank_accounts.id}/verifications",
            "bank_accounts.customer": "/customers/{bank_accounts.customer}",
            "bank_accounts.debits": "/bank_accounts/{bank_accounts.id}/debits",
            "bank_accounts.bank_account_verification": "/verifications/{bank_accounts.bank_account_verification}"
          }
        }
    http_version: 
  recorded_at: Fri, 04 Jul 2014 04:08:58 GMT
- request:
    method: post
    uri: https://<BALANCED_API_KEY>:@api.balancedpayments.com/bank_accounts/BA70rqBlsiiZkoCixFDtEkm5/debits
    body:
      encoding: UTF-8
      string: '{"amount":65000,"appears_on_statement_as":"Epicodus Tuition","description":"Some
        descriptive text for the debit in the dashboard"}'
    headers:
      User-Agent:
      - balanced-ruby/1.1.0
      Content-Type:
      - application/json;revision=1.1
      Accept:
      - application/vnd.api+json;revision=1.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Content-Type:
      - application/json
      Date:
      - Fri, 04 Jul 2014 04:08:58 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMec4fcd14033011e4a4e806429171ffad
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP1mjbKr3ZseFeWrJb4R03lj
      X-Balanced-Merchant:
      - TEST-MR1lb6D220PWeBKNmZs46597
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.2.76
      Content-Length:
      - '1033'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "debits": [
            {
              "status": "succeeded",
              "description": "Some descriptive text for the debit in the dashboard",
              "links": {
                "customer": null,
                "source": "BA70rqBlsiiZkoCixFDtEkm5",
                "order": null,
                "dispute": null
              },
              "updated_at": "2014-07-04T04:08:58.913141Z",
              "created_at": "2014-07-04T04:08:58.648357Z",
              "transaction_number": "W701-029-7563",
              "failure_reason": null,
              "currency": "USD",
              "amount": 65000,
              "failure_reason_code": null,
              "meta": {},
              "href": "/debits/WD7bXQeBxW963bzLyjGefXCZ",
              "appears_on_statement_as": "BAL*Epicodus Tuition",
              "id": "WD7bXQeBxW963bzLyjGefXCZ"
            }
          ],
          "links": {
            "debits.customer": "/customers/{debits.customer}",
            "debits.dispute": "/disputes/{debits.dispute}",
            "debits.source": "/resources/{debits.source}",
            "debits.order": "/orders/{debits.order}",
            "debits.refunds": "/debits/{debits.id}/refunds",
            "debits.events": "/debits/{debits.id}/events"
          }
        }
    http_version: 
  recorded_at: Fri, 04 Jul 2014 04:08:59 GMT
recorded_with: VCR 2.9.2
